'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
N школярів ділять K яблук порівну, залишок, що не ділиться залишається в кошику.
Скільки яблук дістанеться кожному школяру?
Скільки яблук залишиться у кошику?
Програма отримує на вхід числа N і K та повинна вивести вількисть яблук (два числа).
'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

N = int (input("Input boys count N:"))
result = (N)
print("result:", N, type(result))

K = int (input("Input apples count K:"))
result = (K)
print("result:", K, type(result))

B = str("Handing apples= ")
result = (K // N)
print(B, result)

M = str ("Apple reminder= ")
result = (K % N)
print(M, result)
