'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
Заняття 3. Конструкція логічного вибору if - else, цикл - while, for
По даному натуральному числу N знайдіть найбільшу міру 2-ки в ступені, що не перевищує N.
Виведіть показник ступеня і саму міру.
Операцією зведення на ступінь користуватися не можна!
'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''

N = int(input('Input N:'))
power = 0
num = 1
while num * 2 <= N:
    num = num * 2
    power = power + 1
print("power=", power, "count=", num)